{
    "status": "success",
    "totalResults": 1226,
    "results": [
    {
    "title": "Holkar Cricket Stadium Indore pitch report tomorrow match: Indore Cricket Ground pitch report batting or bowling IND vs SA 3rd T20",
    "link": "https://thesportsrush.com/cricket-news-holkar-cricket-stadium-indore-pitch-report-tomorrow-match-indore-cricket-ground-pitch-report-batting-or-bowling-ind-vs-sa-3rd-t20/",
    "keywords": [
    "Cricket",
    "Holkar Stadium",
    "South Africa tour of India 2022"
    ],
    "creator": [
    "Rishikesh Sharma"
    ],
    "video_url": null,
    "description": "Holkar Cricket Stadium Indore pitch report tomorrow match: The SportsRush brings you the pitch report of IND vs SA 3rd T20I. After a high-scoring encounter in Guwahati, the caravan of the India vs South Africa T20I series will now move to Holkar Stadium in Indore. The series is already decided, but both teams would want… The post Holkar Cricket Stadium Indore pitch report tomorrow match: Indore Cricket Ground pitch report batting or bowling IND vs SA 3rd T20 appeared first on The SportsRush.",
    "content": "Holkar Cricket Stadium Indore pitch report tomorrow match: The SportsRush brings you the pitch report of IND vs SA 3rd T20I. After a high-scoring encounter in Guwahati, the caravan of the India vs South Africa T20I series will now move to Holkar Stadium in Indore. The series is already decided, but both teams would want to finish the series with a win. The Indian batting were at its very best in the last game, and the pitch in Indore will also suit their cause. Suryakumar Yadav is in tremendous form, whereas Rohit Sharma, Virat Kohli, KL Rahul and Dinesh Karthik also looked great in the last match. It will be interesting if the Indian team will make any changes to the winning combination. Captain Temba Bavuma has been the biggest liability of the South African side, but dropping him won’t be possible. The way David Miller batted in the last match was amazing, but the rest of the batters have struggled so far. There are some world-class bowlers in the team, but they bowled a lot of full tosses in the last match. Holkar Cricket Stadium Indore pitch report tomorrow match The pitch at Indore’s Holkar Stadium is a batting beauty, and the batters from both sides will be looking forward to this match. There is an even bounce on the wicket, and the batters can play their shots at their will. This pitch has no visible demons, and there is no help for any kind of bowlers. ALSO READ: Holkar Stadium ticket prices This ground is one of the smallest in the world in terms of ground dimensions so it will be very easy for the batters to clear the boundary ropes on this very ground. The outfield of the ground is also very fast, and it will be almost impossible for the fielders to stop the ball once placed in the gap. In addition to the run fest, a special moment as we sign off from Guwahati. #TeamIndia | #INDvSA | @imVkohli | @DineshKarthik pic.twitter.com/SwNGX57Qkc — BCCI (@BCCI) October 2, 2022 This ground has just hosted a couple of T20Is, where India posted 260 runs in the first match. Recently, this ground hosted the games of the Road Safety World Series where the average score was 159 runs. With all being said, this is an excellent pitch to bat on, and the captains would prefer to chase upon winning the toss. A total of 9 IPL matches have been played here, where 8 games were won by the chasing teams. The average 1st innings score was just 160 runs, it does not justify the surface. The team batting first will aim to score above 190 runs as any total is chasable here at this ground. The post Holkar Cricket Stadium Indore pitch report tomorrow match: Indore Cricket Ground pitch report batting or bowling IND vs SA 3rd T20 appeared first on The SportsRush.",
    "pubDate": "2022-10-03 12:11:21",
    "image_url": null,
    "source_id": "thesportsrush",
    "country": [
    "united states of america",
    "united kingdom",
    "india",
    "australia"
    ],
    "category": [
    "sports"
    ],
    "language": "english"
    },
    {
    "title": "Who is Kai Sotto? Looking closely at the player profile of the Filipino basketball star",
    "link": "https://www.sportskeeda.com/basketball/news-who-kai-sotto-looking-closely-player-profile-filipino-basketball-star?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda",
    "keywords": [
    "Basketball"
    ],
    "creator": [
    "Michael Macasero"
    ],
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-10-03 12:08:29",
    "image_url": "https://static.sportskeeda.com/editor/2022/10/5daaa-16647791368384-1920.jpg",
    "source_id": "sportskeeda",
    "country": [
    "india"
    ],
    "category": [
    "sports"
    ],
    "language": "english"
    },
    {
    "title": "T20 World Cup 2022: “Just an awesome figure” - Indian cricketer in Adam Gilchrist’s list of top five T20I players",
    "link": "https://www.sportskeeda.com/cricket-news/t20-world-cup-2022-indian-cricketer-adam-gilchrist-s-list-top-five-t20i-players?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda",
    "keywords": [
    "Cricket News"
    ],
    "creator": [
    "Renin Wilben Albert"
    ],
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-10-03 12:02:05",
    "image_url": "https://static.sportskeeda.com/editor/2022/10/ac00f-16647788658471-1920.jpg",
    "source_id": "sportskeeda",
    "country": [
    "india"
    ],
    "category": [
    "sports"
    ],
    "language": "english"
    },
    {
    "title": "ATP Rankings: Spain's Rafael Nadal skips past Casper Ruud to climb to number 2",
    "link": "https://www.indiatoday.in/sports/tennis/story/atp-rankings-spain-s-rafael-nadal-skips-past-casper-ruud-to-climb-to-number-2-2007872-2022-10-03?utm_source=rss",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": "ATP Rankings: Spain's Rafael Nadal skips past Casper Ruud to climb to number 2",
    "content": null,
    "pubDate": "2022-10-03 12:01:16",
    "image_url": null,
    "source_id": "indiatoday",
    "country": [
    "india"
    ],
    "category": [
    "sports"
    ],
    "language": "english"
    },
    {
    "title": "The duration of the infectious stage of individuals infected with the SARS-CoV-2 Omicron variant",
    "link": "https://www.news-medical.net/news/20221003/The-duration-of-the-infectious-stage-of-individuals-infected-with-the-SARS-CoV-2-Omicron-variant.aspx",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": "Researchers demonstrated clinical features and infectivity of the currently dominant SARS-CoV-2 variant of concern Omicron, compared to Delta, the previously dominant VOC.",
    "content": null,
    "pubDate": "2022-10-03 12:01:00",
    "image_url": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_726863_16647941457742657.jpg",
    "source_id": "news-medical",
    "country": [
    "united states of america",
    "united kingdom",
    "india",
    "australia",
    "singapore",
    "canada"
    ],
    "category": [
    "health"
    ],
    "language": "english"
    },
    {
    "title": "How Michael Jordan Got Rid of the “Cocaine circus” and Took the NBA to New Heights",
    "link": "https://thesportsrush.com/nba-news-how-michael-jordan-got-rid-of-the-cocaine-circus-and-took-the-nba-to-new-heights/",
    "keywords": [
    "Basketball",
    "Magic Johnson",
    "Michael Jordan",
    "NBA",
    "Spencer Haywood"
    ],
    "creator": [
    "Arun Sharma"
    ],
    "video_url": null,
    "description": "Michael Jordan came up against some of the greatest players ever – but he also had to battle something else. Michael Jordan and Hakeem Olajuwon were the talking points of the 80s—their influence on the game started even when they were outside the NBA. They entered the league at a time when the Boston Celtics… The post How Michael Jordan Got Rid of the “Cocaine circus” and Took the NBA to New Heights appeared first on The SportsRush.",
    "content": "Michael Jordan came up against some of the greatest players ever – but he also had to battle something else. Michael Jordan and Hakeem Olajuwon were the talking points of the 80s—their influence on the game started even when they were outside the NBA. They entered the league at a time when the Boston Celtics and Los Angeles Lakers had a shootout almost every year. But aside from the battles on the floor, there was another kind of shootout that was prevalent in the 80s. Guns, drugs, and women—the three keywords for any tabloid to build their stories on. That was the reality, a reality that even the sports leagues could not escape. Players like Spencer Haywood and Len Bias fell victim to the overlord that is cocaine. While Haywood only fainted, Bias lost his life. Touted as the Jordan stopper, he did not make it to the NBA. The 80s were a truly terrible time to be a youngster but Jordan managed to stay out of trouble. “Geniuses are allowed a vice”, as Sherlock Holmes once said. Jordan was not as smart as him, but he chose to smoke cigars and play fools on the floor. Also Read: “They Saw Mike and Threw Us Out”: Michael Jordan Was Once Chucked Out of a Pool for Being African American   View this post on Instagram   A post shared by The Mecca (@basketball_mecca) TV Shows should not be treating Drug Lords as heroes – yet Pablo Escobar and El Chapo remain as one. The 80s was notorious for the prevalence of drugs. It was a time when white powder for the nose cost less than flour to make bread. Shows like Narcos have romanticized drug lords and their rise to power, but the harsh reality of families getting destroyed does not translate well enough to the real world. Not that there is not a growing problem now, but the 70s and the 80s had famous people involved in the hard stuff. Lives were lost, livelihoods destroyed, and many dentists were happy that their business was booming. The buying power of a normal American citizen was at an all-time high, and all they wanted to do was get high themselves. They were not creative in naming the substances but had the most ingenious ways of bringing them in. The NBA has come a long way since the notorious 80s – their revolution began with Michael Jordan Having Michael Jordan entering the peak of the rampant epidemic that was “drug addiction” was a blessing in disguise. Jordan was there for one thing – to play basketball. Bright-eyed and bushy-tailed, the league used him to move their image away from being a hub for substance abuse. Salaries could have been higher in the early years of the league, no doubt, but then they would only be fuelling the players’ funds for more drugs. People in general have become more aware too—they know what legal troubles they can get into. The FBI may have been accused of certain things 40 years ago, but they aren’t as lenient now. If marijuana gets legalized across all 50 states, the transformation will be complete. As for the NBA, the light that Michael Jordan cast on it was enough to pull it out of the shadows. Today, it is one of the world’s most popular sports leagues, and rightfully so. Also Read: Can Zion Williamson Replicate Michael Jordan’s Greatness After Returning From Injury? The post How Michael Jordan Got Rid of the “Cocaine circus” and Took the NBA to New Heights appeared first on The SportsRush.",
    "pubDate": "2022-10-03 12:00:36",
    "image_url": null,
    "source_id": "thesportsrush",
    "country": [
    "united states of america",
    "united kingdom",
    "india",
    "australia"
    ],
    "category": [
    "sports"
    ],
    "language": "english"
    },
    {
    "title": "Indian sports news wrap, October 3",
    "link": "https://sportstar.thehindu.com/other-sports/indian-ports-news-wrap-october-3-results-scores-highlights-report/article65966562.ece",
    "keywords": null,
    "creator": [
    "\n        Team Sportstar  \n    "
    ],
    "video_url": null,
    "description": "Here are all the major developments in Indian sports on October 3, 2022.",
    "content": null,
    "pubDate": "2022-10-03 11:55:47",
    "image_url": null,
    "source_id": "sportstar",
    "country": [
    "india"
    ],
    "category": [
    "sports"
    ],
    "language": "english"
    },
    {
    "title": "3rd T20I: India rest Kohli, Rahul but another stern test awaits bowling unit",
    "link": "https://timesofindia.indiatimes.com/sports/cricket/south-africa-in-india/india-vs-south-africa-3rd-t20i-india-rest-virat-kohli-kl-rahul-but-another-stern-test-awaits-bowling-unit/articleshow/94621884.cms",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": "It may be an inconsequential game on paper but Indian bowlers await another tough test against South Africa ahead of the T20 World Cup when the two teams meet in the final game of the three-match series here on Tuesday. Having sealed their first-ever series against South Africa at home, Indian team management has decided to rest its premier batter Virat Kohli and vice-captain KL Rahul for the final game.",
    "content": null,
    "pubDate": "2022-10-03 11:55:00",
    "image_url": null,
    "source_id": "toi",
    "country": [
    "india"
    ],
    "category": [
    "sports"
    ],
    "language": "english"
    },
    {
    "title": "Women's Asia Cup T20 2022 Points Table: Updated standings after Pakistan Women vs Bangladesh Women, Match 5",
    "link": "https://www.sportskeeda.com/cricket-news/news-women-s-asia-cup-t20-2022-points-table-updated-standings-pakistan-women-vs-bangladesh-women-match-5?utm_source=feed&utm_medium=referral&utm_campaign=sportskeeda",
    "keywords": [
    "Cricket News"
    ],
    "creator": [
    "Sportz Connect"
    ],
    "video_url": null,
    "description": null,
    "content": null,
    "pubDate": "2022-10-03 11:53:40",
    "image_url": "https://static.sportskeeda.com/editor/2022/10/f8d73-16647783058387-1920.jpg",
    "source_id": "sportskeeda",
    "country": [
    "india"
    ],
    "category": [
    "sports"
    ],
    "language": "english"
    },
    {
    "title": "Iga Swiatek maintains healthy lead atop WTA rankings",
    "link": "https://timesofindia.indiatimes.com/sports/tennis/top-stories/iga-swiatek-maintains-healthy-lead-atop-wta-rankings/articleshow/94621829.cms",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": "Pole Iga Swiatek retained her comfortable advantage as world number one as Anett Kontaveit moved to third thanks to a runners-up up finish last weekend, the WTA announced on Monday.",
    "content": null,
    "pubDate": "2022-10-03 11:53:11",
    "image_url": null,
    "source_id": "toi",
    "country": [
    "india"
    ],
    "category": [
    "sports"
    ],
    "language": "english"
    }
    ],
    "nextPage": 1
    }